wyniki_nowe/fio_results_btrfs_nvme/block_size_4096/lab-sec-13/fio_database_article_test_output.txt
database_article_test: (g=0): rw=randrw, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=128
fio-3.36
Starting 1 process
database_article_test: Laying out IO file (1 file / 10240MiB)

database_article_test: (groupid=0, jobs=1): err= 0: pid=14717: Mon Apr 14 21:21:40 2025
  read: IOPS=29.0k, BW=226MiB/s (237MB/s)(5122MiB/22630msec)
    slat (usec): min=3, max=134658, avg= 9.87, stdev=186.82
    clat (usec): min=72, max=1425.8k, avg=2126.51, stdev=14850.90
     lat (usec): min=80, max=1425.9k, avg=2136.38, stdev=14860.29
    clat percentiles (usec):
     |  1.00th=[   289],  5.00th=[   725], 10.00th=[  1037], 20.00th=[  1319],
     | 30.00th=[  1369], 40.00th=[  1418], 50.00th=[  1450], 60.00th=[  1483],
     | 70.00th=[  1549], 80.00th=[  1663], 90.00th=[  2671], 95.00th=[  4883],
     | 99.00th=[  7308], 99.50th=[  8717], 99.90th=[ 48497], 99.95th=[168821],
     | 99.99th=[809501]
   bw (  KiB/s): min=  320, max=328880, per=99.82%, avg=231369.00, stdev=109849.43, samples=45
   iops        : min=   40, max=41110, avg=28921.13, stdev=13731.21, samples=45
  write: IOPS=28.9k, BW=226MiB/s (237MB/s)(5118MiB/22630msec); 0 zone resets
    slat (usec): min=5, max=50872, avg=14.95, stdev=103.15
    clat (usec): min=224, max=1683.4k, avg=2266.90, stdev=19617.04
     lat (usec): min=233, max=1683.5k, avg=2281.85, stdev=19622.04
    clat percentiles (usec):
     |  1.00th=[    873],  5.00th=[   1106], 10.00th=[   1205],
     | 20.00th=[   1287], 30.00th=[   1319], 40.00th=[   1336],
     | 50.00th=[   1369], 60.00th=[   1401], 70.00th=[   1434],
     | 80.00th=[   1762], 90.00th=[   3064], 95.00th=[   4555],
     | 99.00th=[   7439], 99.50th=[   8979], 99.90th=[  88605],
     | 99.95th=[ 278922], 99.99th=[1061159]
   bw (  KiB/s): min=  528, max=325024, per=99.83%, avg=231162.00, stdev=109787.56, samples=45
   iops        : min=   66, max=40628, avg=28895.20, stdev=13723.47, samples=45
  lat (usec)   : 100=0.02%, 250=0.35%, 500=0.99%, 750=1.48%, 1000=3.05%
  lat (msec)   : 2=79.09%, 4=6.59%, 10=8.08%, 20=0.24%, 50=0.01%
  lat (msec)   : 100=0.02%, 250=0.04%, 500=0.01%, 750=0.02%, 1000=0.01%
  lat (msec)   : 2000=0.01%
  cpu          : usr=7.30%, sys=56.15%, ctx=489616, majf=0, minf=14
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=655676,655044,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=226MiB/s (237MB/s), 226MiB/s-226MiB/s (237MB/s-237MB/s), io=5122MiB (5371MB), run=22630-22630msec
  WRITE: bw=226MiB/s (237MB/s), 226MiB/s-226MiB/s (237MB/s-237MB/s), io=5118MiB (5366MB), run=22630-22630msec